{
  "dependance.lib":{
    "Installation des dépendances de":"Dependencies installation for",
    "Avertissement Développeur: L'incrément de pourcentage par étape":"Developer Warning: The percentage increment per step",
    "est inférieur à 2%. Augmentez le range ou diminuez le nombre d'étapes.":"is less than 2%. Increase the range or reduce the number of steps",
    "Avertissement Développeur: subStep appelée":"Developer Warning: subStep has been called",
    "fois, mais numSubStepMax est défini à":"times, but you've defined numSubStepMax to",
    "Adaptez la valeur de numSubStepMax":"Please adapt numSubStepMax",
    "Erreur à l'étape":"Error in step",
    "Ligne":"Line",
    "La commande":"The command",
    "pose problème":"has an issue",
    "Le code de retour est":"Return code is",
    "Le message d'erreur":"Error message",
    "Source trouvée dans":"Source found in",
    "on la retire temporairement":"temporary disabling it",
    "Problème détecté sur la source":"Issue detected on the source",
    "correction en cours":"fixing in progress",
    "Trop d'essais":"Too many tries",
    "on sort avec erreur":"exiting with error",
    "Relance de apt-get update":"Restarting apt-get update",
    "Erreur sur une source principale de la distribution, impossible à corriger":"Error on a main source of the distribution, cannot fix",
    "On réactive la source":"Re-enabling the source",
    "Ouf ! apt-get update a bien fonctionné après":"Phew ! apt-get update did worked fine after",
    "essais":"tries",
    "Cette étape s'est bien déroulée ici, mais attention, d'autres plugins peuvent avoir le problème avec cette source !":"This step went fine in the end, but be aware that other plugins may have the same issue with that source !",
    "TROUVÉ":"FOUND",
    "dans l'erreur, je lance une commande pour corriger (ignorez le warning), attendez 45sec et relancez les dépendances pour réessayer":"in error, launching countermeasures (ignore warning), wait 45sec and relaunch dependencies to retry",
    "dans l'erreur, je lance une commande pour corriger, attendez 45sec et relancez les dépendances pour réessayer":"in error, launching countermeasures, wait 45sec and relaunch dependencies to retry",
    "Terminé":"Finished",
    "Erreur d'Installation":"Installation Error",
    "ANALYSE DES ERREURS":"ANALYSING ERRORS",
    "AUCUNE ERREUR CONNUE DÉTECTÉE":"NO KNOWN ERROR DETECTED",
    "Installation Réussie":"Installation Successful"
  },
  "install_nodejs.sh":{
    "Prérequis":"Prerequisites",
    "Installation des packages nécessaires":"Mandatory packages installation",
    "Vérification du système":"System Check",
    "ATTENTION Debian 8 Jessie n'est officiellement plus supportée depuis le 30 juin 2020, merci de mettre à jour votre système en version plus récente de Debian !!!":"WARNING Debian 8 Jessie is not supported anymore since the 30rd of june 2020, thank you to update your system in a new Debian version !!!",
    "ATTENTION Debian 9 Stretch n'est officiellement plus supportée depuis le 30 juin 2022, merci de mettre à jour votre système en version plus récente de Debian !!!":"WARNING Debian 9 Stretch is not supported anymore since the 30rd of june 2022, thank you to update your system in a new Debian version !!!",
    "ATTENTION Debian 10 Buster n'est officiellement plus supportée depuis le 30 juin 2024, merci de mettre à jour votre système en version plus récente de Debian !!!":"WARNING Debian 10 Buster is not supported anymore since June 30, 2024. Please update your system in a new Debian version!!!",
    "Les dépendances sont bloquées afin d'éviter tout problème, soit":"Dependencies are blocked to avoid any issues. Either",
    "fonctionne et donc on y touche plus tant qu'il tourne, soit il ne fonctionne plus et donc il faut mettre à jour votre système en version plus récente de Debian.":"works and so we don't touch the dependencies as long as it works, or it doesn't work anymore and you have to update your system in a new Debian version.",
    "Fin Septembre, Jeedom passe à NodeJS 20 qui est incompatible avec Debian 10. PLUS AUCUN SUPPORT NE SERA FAIT !!! Migrez donc au plus vite !":"End of September, Jeedom will upgrade to NodeJS 20 that's incompatible with Debian 10. NO SUPPORT WILL BE DONE ANYMORE !!! Please migrate ASAP !",
    "ATTENTION":"WARNING",
    "A VERIFIER AU PLUS VITE":"TO CHECK SOON",
    "ATTENTION Debian 10 Buster n'est officiellement plus supportée depuis le 30 juin 2024, cependant l'image Debian 11 de la Smart est en cours de finalisation par Jeedom.":"WARNING Debian 10 Buster is not supported anymore since June 30, 2024. Nevertheless, the Debian 11 image for the Smart box is still under development by Jeedom.",
    "Les dépendances vont quand même se lancer (mais aucun support ne sera fait si celles-ci ne fonctionnent pas !), surveillez les nouvelles de Jeedom afin de mettre à jour en Debian 11 au plus vite quand ils auront sorti leur nouvelle image.":"Dependancies will continue (but no support will be done if it fails). Watch for Jeedom news to update to Debian 11 as soon as they release the new image.",
    "Vous avez refusé le support, Vous utilisez toujours Debian 10 Buster, L'installation des dépendances va se lancer mais il est possible que ça ne fonctionne pas...":"You have denied any support, Dependencies install will start, but it's possible it doesn't work...",
    "Fin Septembre, Jeedom passe à NodeJS 20 qui est incompatible avec Debian 10. PLUS AUCUN SUPPORT NE SERA FAIT !!! Migrez donc au plus vite !":"End of September, Jeedom will upgrade to NodeJS 20 that's incompatible with Debian 10. NO SUPPORT WILL BE DONE ANYMORE !!! Please migrate ASAP !",
    "ATTENTION Votre système est x86 en 32bits et NodeJS n'y est pas supporté, merci de passer en 64bits !!!":"WARNING Your system is x86 in 32bits and NodeJS does not support it anymore, thank you to reinstall in 64bits !!!",
    "Vérification de la version de NodeJS installée":"Installed NodeJS version check",
    "Erreur: NODE_MAJOR est vide":"Error: NODE_MAJOR is empty",
    "Contenu de":"Content of",
    "Version de node trouvée requiredNodeVersion":"Node version found via requiredNodeVersion",
    "jq n'est pas installé.":"jq is not installed.",
    "Aucune":"None",
    "Check Version NodeJS actuelle":"Check Current NodeJS Version",
    "Correction...":"Fixing...",
    "Installation de NodeJS":"Installing NodeJS",
    "Jeedom Mini ou Raspberry 1, 2 ou zéro détecté, non supporté mais on essaye l'utilisation du paquet non-officiel":"Jeedom Mini or Raspberry 1, 2 or zero detected, unsupported but we try to install unofficial packet",
    "pour":"for",
    "Utilisation du dépot officiel":"Using official repository",
    "Check Version NodeJS après install":"Check NodeJS Version after install",
    "relancez les dépendances":"restart the dependancies",
    "Installation de npm car non présent":"Installing npm because not present",
    "Check Version NPM":"NPM Version Check",
    "MàJ demandée":"Update requested",
    "Mise à jour de npm":"Updating npm",
    "Nettoyage":"Cleaning",
    "Vérification":"Check",
    "Prefixe":"Prefix",
    "et":"and",
    "Réinitialisation prefixe":"Prefix reset",
    
  }
}
